In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20020505"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [3]:
df

     A          B    C  D      E    F
0  1.0 2002-05-05  1.0  3   test  foo
1  1.0 2002-05-05  1.0  3  train  foo
2  1.0 2002-05-05  1.0  3   test  foo
3  1.0 2002-05-05  1.0  3  train  foo

In [4]:
df.to_numpy()

array([[1.0, Timestamp('2002-05-05 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2002-05-05 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2002-05-05 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2002-05-05 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [5]:
df.to_json()

'{"A":{"0":1.0,"1":1.0,"2":1.0,"3":1.0},"B":{"0":1020556800000,"1":1020556800000,"2":1020556800000,"3":1020556800000},"C":{"0":1.0,"1":1.0,"2":1.0,"3":1.0},"D":{"0":3,"1":3,"2":3,"3":3},"E":{"0":"test","1":"train","2":"test","3":"train"},"F":{"0":"foo","1":"foo","2":"foo","3":"foo"}}'

In [8]:
df.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2002-05-05 00:00:00,2002-05-05 00:00:00,2002-05-05 00:00:00,2002-05-05 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [9]:
df["A"]

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [12]:
df[:3]

     A          B    C  D      E    F
0  1.0 2002-05-05  1.0  3   test  foo
1  1.0 2002-05-05  1.0  3  train  foo
2  1.0 2002-05-05  1.0  3   test  foo

In [11]:
df

     A          B    C  D      E    F
0  1.0 2002-05-05  1.0  3   test  foo
1  1.0 2002-05-05  1.0  3  train  foo
2  1.0 2002-05-05  1.0  3   test  foo
3  1.0 2002-05-05  1.0  3  train  foo

In [13]:
df.loc[1]

A                    1.0
B    2002-05-05 00:00:00
C                    1.0
D                      3
E                  train
F                    foo
Name: 1, dtype: object

In [19]:
df.loc[1:3]

     A          B    C  D      E    F
1  1.0 2002-05-05  1.0  3  train  foo
2  1.0 2002-05-05  1.0  3   test  foo
3  1.0 2002-05-05  1.0  3  train  foo

In [22]:
df.loc[:, ["A", "B"]]

     A          B
0  1.0 2002-05-05
1  1.0 2002-05-05
2  1.0 2002-05-05
3  1.0 2002-05-05

In [35]:
dates = [pd.Timestamp("20020505")]

In [36]:
dates

[Timestamp('2002-05-05 00:00:00')]

In [43]:
df[df["A"] > 0]

     A          B    C  D      E    F
0  1.0 2002-05-05  1.0  3   test  foo
1  1.0 2002-05-05  1.0  3  train  foo
2  1.0 2002-05-05  1.0  3   test  foo
3  1.0 2002-05-05  1.0  3  train  foo

In [47]:
df[df["E"] == 'test']

     A          B    C  D     E    F
0  1.0 2002-05-05  1.0  3  test  foo
2  1.0 2002-05-05  1.0  3  test  foo

In [49]:
df[df["E"].isin(['test'])]

     A          B    C  D     E    F
0  1.0 2002-05-05  1.0  3  test  foo
2  1.0 2002-05-05  1.0  3  test  foo

In [50]:
df1 = df["A"].copy()

In [51]:
df1

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64